Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкПараметрыЛогирования. Модуль менеджера. ПолучитьПараметры()")
			.ДобавитьСерверныйТест("ПолучитьПараметры_ВозвращаетЗначенияПоУмолчанию",
				"ПолучитьПараметры(). Возвращает значения по умолчанию")
				.Перед("ОчиститьДанные")
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкПараметрыЛогирования. Модуль менеджера. ОбновитьПараметры()")
			.ДобавитьСерверныйТест("ОбновитьПараметры_СохраняетВсеЗначения",
				"ОбновитьПараметры(). Сохраняет все значения")
				.Перед("ОчиститьДанные");
	
КонецПроцедуры

Процедура ОчиститьДанные() Экспорт
	РегистрыСведений.кфкПараметрыЛогирования.СоздатьНаборЗаписей().Записать();
КонецПроцедуры



Процедура ПолучитьПараметры_ВозвращаетЗначенияПоУмолчанию() Экспорт
	
	Параметры = РегистрыСведений.кфкПараметрыЛогирования.ПолучитьПараметры();
	
	ЮТест.ОжидаетЧто(Параметры, "Параметры логирования")
		.Равно(ПараметрыПоУмолчанию());
	
КонецПроцедуры

Процедура ОбновитьПараметры_СохраняетВсеЗначения() Экспорт
	
	ОжидаемыеПараметры = Новый Структура;
	ОжидаемыеПараметры.Вставить("Использовать", Истина);
	ОжидаемыеПараметры.Вставить("АдресСервиса", "http://localhost:8080");
	ОжидаемыеПараметры.Вставить("Префикс", "unit");
	ОжидаемыеПараметры.Вставить("ВыгружатьИсходныеДанныеИсходящих", Истина);
	ОжидаемыеПараметры.Вставить("ВыгружатьЗаголовкиСообщенияИсходящих", Истина);
	ОжидаемыеПараметры.Вставить("ВыгружатьТелоСообщенияИсходящих", Истина);
	ОжидаемыеПараметры.Вставить("ВыгружатьЗаголовкиСообщенияВходящих", Истина);
	ОжидаемыеПараметры.Вставить("ВыгружатьТелоСообщенияВходящие", Истина);
	
	РегистрыСведений.кфкПараметрыЛогирования.ОбновитьПараметры(ОжидаемыеПараметры);
	ФактическиеПараметры = РегистрыСведений.кфкПараметрыЛогирования.ПолучитьПараметры();
	
	ЮТест.ОжидаетЧто(ФактическиеПараметры, "Сохраненные параметры логирования")
		.Равно(ОжидаемыеПараметры);
	
КонецПроцедуры

Функция ПараметрыПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("Использовать", Ложь);
	Результат.Вставить("АдресСервиса", "");
	Результат.Вставить("Префикс", "");
	Результат.Вставить("ВыгружатьИсходныеДанныеИсходящих", Ложь);
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияИсходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияИсходящих", Ложь);
	Результат.Вставить("ВыгружатьЗаголовкиСообщенияВходящих", Ложь);
	Результат.Вставить("ВыгружатьТелоСообщенияВходящие", Ложь);
	
	Возврат Результат;
	
КонецФункции
