#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Инъекция ошибки ограничена набором, явно помеченным своим консьюмером.
// Параметры:
//  Отказ - Булево
//  Замещение - Булево, РежимЗамещения
&Перед("ПередЗаписью")
Процедура ют_ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КонсьюмерТеста = Неопределено; // СправочникСсылка.кфкКонсьюмеры
	Если Не ДополнительныеСвойства.Свойство("ют_ОтказПолучения", КонсьюмерТеста) Тогда
		Возврат;
	КонецЕсли;
	Набор = ЭтотОбъект; // РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
	Для Каждого Запись Из Набор Цикл
		Если Запись.Консьюмер = КонсьюмерТеста Тогда
			ВызватьИсключение "Ошибка сохранения входящего пакета для теста";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
