#Область СлужебныеПроцедурыИФункции

// См. ДлительныеОперации.ВыполнитьФункцию
//@skip-check method-too-many-params
&Around("ВыполнитьФункцию")
Функция ют_ВыполнитьФункцию(
		Знач ПараметрыВыполнения,
		ИмяФункции,
		Знач Параметр1 = Неопределено,
		Знач Параметр2 = Неопределено,
		Знач Параметр3 = Неопределено,
		Знач Параметр4 = Неопределено,
		Знач Параметр5 = Неопределено,
		Знач Параметр6 = Неопределено,
		Знач Параметр7 = Неопределено)

	Аргументы = ЮТМетоды.МассивПараметров(
		ПараметрыВыполнения,
		ИмяФункции,
		Параметр1,
		Параметр2,
		Параметр3,
		Параметр4,
		Параметр5,
		Параметр6,
		Параметр7); // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		ДлительныеОперации,
		"ВыполнитьФункцию",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов(
		ПараметрыВыполнения,
		ИмяФункции,
		Параметр1,
		Параметр2,
		Параметр3,
		Параметр4,
		Параметр5,
		Параметр6,
		Параметр7);
	Возврат Результат;

КонецФункции

#КонецОбласти
