#Область СлужебныеПроцедурыИФункции

// Изолирует отмену фонового задания тестового запуска.
// Параметры:
//  РегламентноеЗадание - ОбъектМетаданныхРегламентноеЗадание, Неопределено - Адресат отмены.
//  ТекстДляЖурнала - Строка - Причина отмены.
&Вместо("ОтменитьВыполнениеЗадания")
Процедура ют_ОтменитьВыполнениеЗадания(Знач РегламентноеЗадание, ТекстДляЖурнала)

	ПрерватьВыполнение = Ложь;
	Аргументы = Новый Массив; // Массив из Произвольный
	Аргументы.Добавить(РегламентноеЗадание);
	Аргументы.Добавить(ТекстДляЖурнала);
	МокитоПерехват.АнализВызова(РегламентныеЗаданияСервер,
		"ОтменитьВыполнениеЗадания", Аргументы, ПрерватьВыполнение);
	Если Не ПрерватьВыполнение Тогда
		ПродолжитьВызов(РегламентноеЗадание, ТекстДляЖурнала);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
