#Область СлужебныеПроцедурыИФункции

// См. кфкОбработкаСобытийСлужебный.ПараметрыРегистрации
&Around("ПараметрыРегистрации")
Функция ют_ПараметрыРегистрации(Продюсеры = Неопределено, ПакетныйРежимЗаписи = Ложь)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Продюсеры);
	Аргументы.Добавить(ПакетныйРежимЗаписи);
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкОбработкаСобытийСлужебный,
		"ПараметрыРегистрации",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов(Продюсеры, ПакетныйРежимЗаписи);
	Возврат Результат;

КонецФункции

// См. кфкОбработкаСобытийСлужебный.МаксРазмерПорцииРегистрации
&Around("МаксРазмерПорцииРегистрации")
Функция ют_МаксРазмерПорцииРегистрации()

	Аргументы = Новый Массив; // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкОбработкаСобытийСлужебный,
		"МаксРазмерПорцииРегистрации",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов();
	Возврат Результат;

КонецФункции

// См. кфкОбработкаСобытийСлужебный.ПоместитьВОчередьИсходящих
&Around("ПоместитьВОчередьИсходящих")
Процедура ют_ПоместитьВОчередьИсходящих(Источник, СобытиеРегистрации, ТипОбъект = "", ЭтоУдаление = Ложь,
		ПараметрыРегистрации = Неопределено)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Источник);
	Аргументы.Добавить(СобытиеРегистрации);
	Аргументы.Добавить(ТипОбъект);
	Аргументы.Добавить(ЭтоУдаление);
	Аргументы.Добавить(ПараметрыРегистрации);
	ПрерватьВыполнение = Ложь;
	МокитоПерехват.АнализВызова(
		кфкОбработкаСобытийСлужебный,
		"ПоместитьВОчередьИсходящих",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат;
	КонецЕсли;

	ПродолжитьВызов(Источник, СобытиеРегистрации, ТипОбъект, ЭтоУдаление, ПараметрыРегистрации);

КонецПроцедуры

// См. кфкОбработкаСобытийСлужебный.ЗавершитьРегистрацию
&Around("ЗавершитьРегистрацию")
Процедура ют_ЗавершитьРегистрацию(Параметры, ОчиститьОчередь = Ложь)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Параметры);
	Аргументы.Добавить(ОчиститьОчередь);
	ПрерватьВыполнение = Ложь;
	МокитоПерехват.АнализВызова(
		кфкОбработкаСобытийСлужебный,
		"ЗавершитьРегистрацию",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат;
	КонецЕсли;

	ПродолжитьВызов(Параметры, ОчиститьОчередь);

КонецПроцедуры

// См. кфкОбработкаСобытийСлужебный.КлючОбъекта
&Around("КлючОбъекта")
Функция ют_КлючОбъекта(Данные, HexСтрока)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Данные);
	Аргументы.Добавить(HexСтрока);
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкОбработкаСобытийСлужебный,
		"КлючОбъекта",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов(Данные, HexСтрока);
	Возврат Результат;

КонецФункции

// См. кфкОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений
&Around("КлючЗаписиИсходящихСообщений")
Функция ют_КлючЗаписиИсходящихСообщений(Данные)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Данные);
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкОбработкаСобытийСлужебный,
		"КлючЗаписиИсходящихСообщений",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов(Данные);
	Возврат Результат;

КонецФункции

#КонецОбласти
