//@strict-types

#Область СлужебныеПроцедурыИФункции

// См. ОбщегоНазначенияКлиентСервер.СравнитьВерсии
&Around("СравнитьВерсии")
Функция ют_СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)

	Аргументы = ЮТМетоды.МассивПараметров(СтрокаВерсии1, СтрокаВерсии2); // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		ОбщегоНазначенияКлиентСервер,
		"СравнитьВерсии",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов(СтрокаВерсии1, СтрокаВерсии2);
	Возврат Результат;

КонецФункции

#КонецОбласти
