//@strict-types

#Область СлужебныеПроцедурыИФункции

// См. кфкИнтеграцияСлужебный.Отправить
&Around("Отправить")
Функция ют_Отправить(Продюсер, ИмяТопика, Сообщение, Партиция = -1, Сессии = Неопределено)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Продюсер);
	Аргументы.Добавить(ИмяТопика);
	Аргументы.Добавить(Сообщение);
	Аргументы.Добавить(Партиция);
	Аргументы.Добавить(Сессии);
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкИнтеграцияСлужебный,
		"Отправить",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов(Продюсер, ИмяТопика, Сообщение, Партиция, Сессии);
	Возврат Результат;

КонецФункции

// См. кфкИнтеграцияСлужебный.Прочитать
&Around("Прочитать")
Функция ют_Прочитать(Консьюмер, АвтоФиксацияСмещения, Сессии = Неопределено)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Консьюмер);
	Аргументы.Добавить(АвтоФиксацияСмещения);
	Аргументы.Добавить(Сессии);
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкИнтеграцияСлужебный,
		"Прочитать",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов(Консьюмер, АвтоФиксацияСмещения, Сессии);
	Возврат Результат;

КонецФункции

// См. кфкИнтеграцияСлужебный.ЗакрытьСессииПродюсера
&Around("ЗакрытьСессииПродюсера")
Процедура ют_ЗакрытьСессииПродюсера(Сессии)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Сессии);
	ПрерватьВыполнение = Ложь;
	МокитоПерехват.АнализВызова(
		кфкИнтеграцияСлужебный,
		"ЗакрытьСессииПродюсера",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат;
	КонецЕсли;

	ПродолжитьВызов(Сессии);

КонецПроцедуры

// См. кфкИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера
&Around("ЗакрытьСессииКонсьюмера")
Процедура ют_ЗакрытьСессииКонсьюмера(Сессии)

	Аргументы = Новый Массив; // Массив Из Произвольный
	Аргументы.Добавить(Сессии);
	ПрерватьВыполнение = Ложь;
	МокитоПерехват.АнализВызова(
		кфкИнтеграцияСлужебный,
		"ЗакрытьСессииКонсьюмера",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат;
	КонецЕсли;

	ПродолжитьВызов(Сессии);

КонецПроцедуры

#КонецОбласти
