#Область ПрограммныйИнтерфейс

// Регистрирует проверки фасада интеграции с подменой служебных зависимостей.
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ВТранзакции()
		.После("ПослеКаждогоТеста")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. Отключить()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("Отключить")
			.ДобавитьСерверныйТест("Отключить_УстанавливаетФлагИСохраняетОстальныеСвойства",
				"Отключить(). УстанавливаетФлагИСохраняетОстальныеСвойства")
				.Тег("УстанавливаетФлагИСохраняетОстальныеСвойства")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ПоместитьВОчередьИсходящих()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ПоместитьВОчередьИсходящих")
			.ДобавитьСерверныйТест("ПоместитьВОчередьИсходящих_НеРегистрируетПриОтключеннойОпции",
				"ПоместитьВОчередьИсходящих(). НеРегистрируетПриОтключеннойОпции")
				.Тег("НеРегистрируетПриОтключеннойОпции")
				.ВТранзакции(Ложь)
			.ДобавитьСерверныйТест("ПоместитьВОчередьИсходящих_ПередаетОдиночныйОбъект",
				"ПоместитьВОчередьИсходящих(). ПередаетОдиночныйОбъект")
				.Тег("ПередаетОдиночныйОбъект")
			.ДобавитьСерверныйТест("ПоместитьВОчередьИсходящих_ПередаетЗначенияПоУмолчанию",
				"ПоместитьВОчередьИсходящих(). ПередаетЗначенияПоУмолчанию")
				.Тег("ПередаетЗначенияПоУмолчанию")
			.ДобавитьСерверныйТест("ПоместитьВОчередьИсходящих_РазбиваетМассивНаПорции",
				"ПоместитьВОчередьИсходящих(). РазбиваетМассивНаПорции")
				.Тег("РазбиваетМассивНаПорции")
				.СПараметрами(0)
				.СПараметрами(1)
				.СПараметрами(2)
				.СПараметрами(3)
				.СПараметрами(4)
				.СПараметрами(5)
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ЭтоРегистрацияПриЗаписи()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ЭтоРегистрацияПриЗаписи")
			.ДобавитьСерверныйТест("ЭтоРегистрацияПриЗаписи_РаспознаетСобытие",
				"ЭтоРегистрацияПриЗаписи(). РаспознаетСобытие")
				.Тег("РаспознаетСобытие")
				.СПараметрами("ПриЗаписи", Истина)
				.СПараметрами("Программно", Ложь)
				.СПараметрами("Принудительно", Ложь)
			.ДобавитьСерверныйТест("ЭтоРегистрацияПриЗаписи_ОтклоняетОтсутствующееСобытие",
				"ЭтоРегистрацияПриЗаписи(). ОтклоняетОтсутствующееСобытие")
				.Тег("ОтклоняетОтсутствующееСобытие")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ЭтоРегистрацияПрограммно()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ЭтоРегистрацияПрограммно")
			.ДобавитьСерверныйТест("ЭтоРегистрацияПрограммно_РаспознаетСобытие",
				"ЭтоРегистрацияПрограммно(). РаспознаетСобытие")
				.Тег("РаспознаетСобытие")
				.СПараметрами("ПриЗаписи", Ложь)
				.СПараметрами("Программно", Истина)
				.СПараметрами("Принудительно", Ложь)
			.ДобавитьСерверныйТест("ЭтоРегистрацияПрограммно_ОтклоняетОтсутствующееСобытие",
				"ЭтоРегистрацияПрограммно(). ОтклоняетОтсутствующееСобытие")
				.Тег("ОтклоняетОтсутствующееСобытие")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ЭтоРегистрацияПринудительно()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ЭтоРегистрацияПринудительно")
			.ДобавитьСерверныйТест("ЭтоРегистрацияПринудительно_РаспознаетСобытие",
				"ЭтоРегистрацияПринудительно(). РаспознаетСобытие")
				.Тег("РаспознаетСобытие")
				.СПараметрами("ПриЗаписи", Ложь)
				.СПараметрами("Программно", Ложь)
				.СПараметрами("Принудительно", Истина)
			.ДобавитьСерверныйТест("ЭтоРегистрацияПринудительно_ОтклоняетОтсутствующееСобытие",
				"ЭтоРегистрацияПринудительно(). ОтклоняетОтсутствующееСобытие")
				.Тег("ОтклоняетОтсутствующееСобытие")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. КлючОбъекта()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("КлючОбъекта")
			.ДобавитьСерверныйТест("КлючОбъекта_ПередаетДанныеИПризнакШестнадцатеричногоКлюча",
				"КлючОбъекта(). ПередаетДанныеИПризнакШестнадцатеричногоКлюча")
				.Тег("ПередаетДанныеИПризнакШестнадцатеричногоКлюча")
			.ДобавитьСерверныйТест("КлючОбъекта_СохраняетНеопределенныйРезультат",
				"КлючОбъекта(). СохраняетНеопределенныйРезультат")
				.Тег("СохраняетНеопределенныйРезультат")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. КлючЗаписиИсходящихСообщений()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("КлючЗаписиИсходящихСообщений")
			.ДобавитьСерверныйТест("КлючЗаписиИсходящихСообщений_ВозвращаетКлючиЗависимости",
				"КлючЗаписиИсходящихСообщений(). ВозвращаетКлючиЗависимости")
				.Тег("ВозвращаетКлючиЗависимости")
			.ДобавитьСерверныйТест("КлючЗаписиИсходящихСообщений_СохраняетНеопределенныйРезультат",
				"КлючЗаписиИсходящихСообщений(). СохраняетНеопределенныйРезультат")
				.Тег("СохраняетНеопределенныйРезультат")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. Отправить()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("Отправить")
			.ДобавитьСерверныйТест("Отправить_ПередаетАргументыИРезультат",
				"Отправить(). ПередаетАргументыИРезультат")
				.Тег("ПередаетАргументыИРезультат")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. Прочитать()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("Прочитать")
			.ДобавитьСерверныйТест("Прочитать_ПередаетАргументыИРезультат",
				"Прочитать(). ПередаетАргументыИРезультат")
				.Тег("ПередаетАргументыИРезультат")
				.СПараметрами(Истина, Истина)
				.СПараметрами(Истина, Ложь)
				.СПараметрами(Ложь, Истина)
				.СПараметрами(Ложь, Ложь)
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ЗакрытьСессииПродюсера()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ЗакрытьСессииПродюсера")
			.ДобавитьСерверныйТест("ЗакрытьСессииПродюсера_ПередаетКоллекциюСессий",
				"ЗакрытьСессииПродюсера(). ПередаетКоллекциюСессий")
				.Тег("ПередаетКоллекциюСессий")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ЗакрытьСессииКонсьюмера()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ЗакрытьСессииКонсьюмера")
			.ДобавитьСерверныйТест("ЗакрытьСессииКонсьюмера_ПередаетКоллекциюСессий",
				"ЗакрытьСессииКонсьюмера(). ПередаетКоллекциюСессий")
				.Тег("ПередаетКоллекциюСессий")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ПараметрыСообщения()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ПараметрыСообщения")
			.ДобавитьСерверныйТест("ПараметрыСообщения_СоздаетЗначенияПоУмолчанию",
				"ПараметрыСообщения(). СоздаетЗначенияПоУмолчанию")
				.Тег("СоздаетЗначенияПоУмолчанию")
			.ДобавитьСерверныйТест("ПараметрыСообщения_СохраняетДанныеИСоздаетНезависимыеЗаголовки",
				"ПараметрыСообщения(). СохраняетДанныеИСоздаетНезависимыеЗаголовки")
				.Тег("СохраняетДанныеИСоздаетНезависимыеЗаголовки")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. РезультатИнтеграции()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("РезультатИнтеграции")
			.ДобавитьСерверныйТест("РезультатИнтеграции_СоздаетНезависимыеРезультаты",
				"РезультатИнтеграции(). СоздаетНезависимыеРезультаты")
				.Тег("СоздаетНезависимыеРезультаты")
		.ДобавитьТестовыйНабор("Общий модуль кфкИнтеграция. ПриОпределенииКомандПодключенныхКОбъекту()")
			.Тег("Модульные")
			.Тег("кфкИнтеграция")
			.Тег("ПриОпределенииКомандПодключенныхКОбъекту")
			.ДобавитьСерверныйТест("ПриОпределенииКомандПодключенныхКОбъекту_СкрываетКомандуНедоступнойПодсистемы",
				"ПриОпределенииКомандПодключенныхКОбъекту(). СкрываетКомандуНедоступнойПодсистемы")
				.Тег("СкрываетКомандуНедоступнойПодсистемы")
			.ДобавитьСерверныйТест("ПриОпределенииКомандПодключенныхКОбъекту_СкрываетКомандуНеучаствующегоРегистра",
				"ПриОпределенииКомандПодключенныхКОбъекту(). СкрываетКомандуНеучаствующегоРегистра")
				.Тег("СкрываетКомандуНеучаствующегоРегистра")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
			.ДобавитьСерверныйТест("ПриОпределенииКомандПодключенныхКОбъекту_ДобавляетКомандуДляРегистра",
				"ПриОпределенииКомандПодключенныхКОбъекту(). ДобавляетКомандуДляРегистра")
				.Тег("ДобавляетКомандуДляРегистра")
			.ДобавитьСерверныйТест("ПриОпределенииКомандПодключенныхКОбъекту_ДобавляетКомандуДляСсылочногоОбъекта",
				"ПриОпределенииКомандПодключенныхКОбъекту(). ДобавляетКомандуДляСсылочногоОбъекта")
				.Тег("ДобавляетКомандуДляСсылочногоОбъекта");

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сбрасывает подмены и кэш зависимостей после каждого сценария.
Процедура ПослеКаждогоТеста() Экспорт

	Мокито.Сбросить();
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

// Проверяет: УстанавливаетФлагИСохраняетОстальныеСвойства.
Процедура Отключить_УстанавливаетФлагИСохраняетОстальныеСвойства() Экспорт

	Источник = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Источник.ДополнительныеСвойства.Вставить("кфкПропуститьРегистрацию", Ложь);
	Источник.ДополнительныеСвойства.Вставить("Сохранить", "исходное значение");

	кфкИнтеграция.Отключить(Источник);
	кфкИнтеграция.Отключить(Источник);

	ЮТест.ОжидаетЧто(Источник.ДополнительныеСвойства.кфкПропуститьРегистрацию).Равно(Истина);
	ЮТест.ОжидаетЧто(Источник.ДополнительныеСвойства.Сохранить).Равно("исходное значение");

КонецПроцедуры

#Область ПоместитьВОчередьИсходящих

// Проверяет: НеРегистрируетПриОтключеннойОпции.
Процедура ПоместитьВОчередьИсходящих_НеРегистрируетПриОтключеннойОпции() Экспорт

	ИспользоватьИнтеграцию = Константы.кфкИспользоватьИнтеграцию.Получить();
	Попытка
		Константы.кфкИспользоватьИнтеграцию.Установить(Ложь);
		ЮТест.ОжидаетЧто(ПолучитьФункциональнуюОпцию("кфкИспользоватьИнтеграцию")).Равно(Ложь);
		Мокито.Обучение(кфкОбработкаСобытийСлужебный)
			.Когда("ПараметрыРегистрации")
				.Вернуть(Новый Структура);
		Мокито.Прогон();

		кфкИнтеграция.ПоместитьВОчередьИсходящих(Новый Структура);

		Мокито.Проверить(кфкОбработкаСобытийСлужебный)
			.КоличествоВызовов("ПараметрыРегистрации").Равно(0);
	Исключение
		Константы.кфкИспользоватьИнтеграцию.Установить(ИспользоватьИнтеграцию);
		ВызватьИсключение;
	КонецПопытки;
	Константы.кфкИспользоватьИнтеграцию.Установить(ИспользоватьИнтеграцию);

КонецПроцедуры

// Проверяет: ПередаетОдиночныйОбъект.
Процедура ПоместитьВОчередьИсходящих_ПередаетОдиночныйОбъект() Экспорт

	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	ЮТест.ОжидаетЧто(ПолучитьФункциональнуюОпцию("кфкИспользоватьИнтеграцию")).Равно(Истина);
	Источник = Новый Структура("Сообщение", "одиночное");
	Продюсер = Справочники.кфкПродюсеры.ПустаяСсылка();
	ТипОбъекта = "ПроизвольноеСообщение";
	Параметры = НовыеПараметрыРегистрации();
	НастроитьРегистрацию(Параметры);

	кфкИнтеграция.ПоместитьВОчередьИсходящих(Источник, ТипОбъекта, Продюсер);

	Аргументы = ЮТМетоды.МассивПараметров(Продюсер, Ложь);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("ПараметрыРегистрации", Аргументы).Равно(1);
	Аргументы = ЮТМетоды.МассивПараметров(
		Источник,
		Перечисления.кфкСобытияРегистрации.Программно,
		ТипОбъекта,
		Ложь,
		Параметры);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("ПоместитьВОчередьИсходящих", Аргументы).Равно(1)
		.КоличествоВызовов("ЗавершитьРегистрацию").Равно(0);

КонецПроцедуры

// Проверяет: ПередаетЗначенияПоУмолчанию.
Процедура ПоместитьВОчередьИсходящих_ПередаетЗначенияПоУмолчанию() Экспорт

	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	Источник = Новый Структура("Сообщение", "по умолчанию");
	Параметры = НовыеПараметрыРегистрации();
	НастроитьРегистрацию(Параметры);

	кфкИнтеграция.ПоместитьВОчередьИсходящих(Источник);

	Аргументы = ЮТМетоды.МассивПараметров(Неопределено, Ложь);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("ПараметрыРегистрации", Аргументы).Равно(1);
	Аргументы = ЮТМетоды.МассивПараметров(
		Источник,
		Перечисления.кфкСобытияРегистрации.Программно,
		"",
		Ложь,
		Параметры);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("ПоместитьВОчередьИсходящих", Аргументы).Равно(1);

КонецПроцедуры

// Проверяет: РазбиваетМассивНаПорции.
// Параметры:
//  Количество - Число - размер пакета относительно порции из двух сообщений.
Процедура ПоместитьВОчередьИсходящих_РазбиваетМассивНаПорции(Знач Количество) Экспорт

	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	Источник = Новый Массив; // Массив Из Строка
	Для Номер = 1 По Количество Цикл
		Источник.Добавить("сообщение-" + Строка(Номер));
	КонецЦикла;
	Параметры = НовыеПараметрыРегистрации();
	НастроитьРегистрацию(Параметры);

	кфкИнтеграция.ПоместитьВОчередьИсходящих(Источник);

	Аргументы = ЮТМетоды.МассивПараметров(Неопределено, Истина);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("ПараметрыРегистрации", Аргументы).Равно(1)
		.КоличествоВызовов("МаксРазмерПорцииРегистрации").Равно(1)
		.КоличествоВызовов("ПоместитьВОчередьИсходящих").Равно(Количество);
	Для Каждого Элемент Из Источник Цикл

		Аргументы = ЮТМетоды.МассивПараметров(
			Элемент,
			Перечисления.кфкСобытияРегистрации.Программно,
			"",
			Ложь,
			Параметры);
		Мокито.Проверить(кфкОбработкаСобытийСлужебный)
			.КоличествоВызовов("ПоместитьВОчередьИсходящих", Аргументы).Равно(1);

	КонецЦикла;

	РазмерПорции = 2;
	Аргументы = ЮТМетоды.МассивПараметров(Параметры, Истина);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("ЗавершитьРегистрацию", Аргументы).Равно(Цел(Количество / РазмерПорции));
	Аргументы = ЮТМетоды.МассивПараметров(Параметры, Ложь);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("ЗавершитьРегистрацию", Аргументы).Равно(1);

КонецПроцедуры

#КонецОбласти

#Область ЭтоРегистрацияПриЗаписи

// Проверяет: РаспознаетСобытие.
// Параметры:
//  ИмяСобытия - Строка - имя значения перечисления.
//  Ожидается - Булево - результат распознавания.
Процедура ЭтоРегистрацияПриЗаписи_РаспознаетСобытие(Знач ИмяСобытия, Знач Ожидается) Экспорт

	Свойства = Новый Структура("СобытиеРегистрации", Перечисления.кфкСобытияРегистрации[ИмяСобытия]);

	Результат = кфкИнтеграция.ЭтоРегистрацияПриЗаписи(Свойства);

	ЮТест.ОжидаетЧто(Результат).Равно(Ожидается);

КонецПроцедуры

// Проверяет: ОтклоняетОтсутствующееСобытие.
// Параметры:
//  СвойствоПрисутствует - Булево - явное Неопределено или отсутствующее свойство.
Процедура ЭтоРегистрацияПриЗаписи_ОтклоняетОтсутствующееСобытие(Знач СвойствоПрисутствует) Экспорт

	Свойства = Новый Структура;
	Если СвойствоПрисутствует Тогда
		Свойства.Вставить("СобытиеРегистрации", Неопределено);
	КонецЕсли;
	Аргументы = ЮТМетоды.МассивПараметров(Свойства);

	ЮТест.ОжидаетЧто(кфкИнтеграция)
		.Метод("ЭтоРегистрацияПриЗаписи", Аргументы)
		.ВыбрасываетИсключение("Не указано событие регистрации!");

КонецПроцедуры

#КонецОбласти

#Область ЭтоРегистрацияПрограммно

// Проверяет: РаспознаетСобытие.
// Параметры:
//  ИмяСобытия - Строка - имя значения перечисления.
//  Ожидается - Булево - результат распознавания.
Процедура ЭтоРегистрацияПрограммно_РаспознаетСобытие(Знач ИмяСобытия, Знач Ожидается) Экспорт

	Свойства = Новый Структура("СобытиеРегистрации", Перечисления.кфкСобытияРегистрации[ИмяСобытия]);

	Результат = кфкИнтеграция.ЭтоРегистрацияПрограммно(Свойства);

	ЮТест.ОжидаетЧто(Результат).Равно(Ожидается);

КонецПроцедуры

// Проверяет: ОтклоняетОтсутствующееСобытие.
// Параметры:
//  СвойствоПрисутствует - Булево - явное Неопределено или отсутствующее свойство.
Процедура ЭтоРегистрацияПрограммно_ОтклоняетОтсутствующееСобытие(Знач СвойствоПрисутствует) Экспорт

	Свойства = Новый Структура;
	Если СвойствоПрисутствует Тогда
		Свойства.Вставить("СобытиеРегистрации", Неопределено);
	КонецЕсли;
	Аргументы = ЮТМетоды.МассивПараметров(Свойства);

	ЮТест.ОжидаетЧто(кфкИнтеграция)
		.Метод("ЭтоРегистрацияПрограммно", Аргументы)
		.ВыбрасываетИсключение("Не указано событие регистрации!");

КонецПроцедуры

#КонецОбласти

#Область ЭтоРегистрацияПринудительно

// Проверяет: РаспознаетСобытие.
// Параметры:
//  ИмяСобытия - Строка - имя значения перечисления.
//  Ожидается - Булево - результат распознавания.
Процедура ЭтоРегистрацияПринудительно_РаспознаетСобытие(Знач ИмяСобытия, Знач Ожидается) Экспорт

	Свойства = Новый Структура("СобытиеРегистрации", Перечисления.кфкСобытияРегистрации[ИмяСобытия]);

	Результат = кфкИнтеграция.ЭтоРегистрацияПринудительно(Свойства);

	ЮТест.ОжидаетЧто(Результат).Равно(Ожидается);

КонецПроцедуры

// Проверяет: ОтклоняетОтсутствующееСобытие.
// Параметры:
//  СвойствоПрисутствует - Булево - явное Неопределено или отсутствующее свойство.
Процедура ЭтоРегистрацияПринудительно_ОтклоняетОтсутствующееСобытие(Знач СвойствоПрисутствует) Экспорт

	Свойства = Новый Структура;
	Если СвойствоПрисутствует Тогда
		Свойства.Вставить("СобытиеРегистрации", Неопределено);
	КонецЕсли;
	Аргументы = ЮТМетоды.МассивПараметров(Свойства);

	ЮТест.ОжидаетЧто(кфкИнтеграция)
		.Метод("ЭтоРегистрацияПринудительно", Аргументы)
		.ВыбрасываетИсключение("Не указано событие регистрации!");

КонецПроцедуры

#КонецОбласти

#Область КлючОбъекта

// Проверяет: ПередаетДанныеИПризнакШестнадцатеричногоКлюча.
Процедура КлючОбъекта_ПередаетДанныеИПризнакШестнадцатеричногоКлюча() Экспорт

	Данные = Справочники.кфкПродюсеры.ПустаяСсылка();
	Ожидается = "00112233445566778899aabbccddeeff";
	Аргументы = ЮТМетоды.МассивПараметров(Данные, Истина);
	Мокито.Обучение(кфкОбработкаСобытийСлужебный)
		.Когда("КлючОбъекта", Аргументы)
			.Вернуть(Ожидается);
	Мокито.Прогон();

	Результат = кфкИнтеграция.КлючОбъекта(Данные);

	ЮТест.ОжидаетЧто(Результат).Равно(Ожидается);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("КлючОбъекта", Аргументы).Равно(1);

КонецПроцедуры

// Проверяет: СохраняетНеопределенныйРезультат.
Процедура КлючОбъекта_СохраняетНеопределенныйРезультат() Экспорт

	Мокито.Обучение(кфкОбработкаСобытийСлужебный)
		.Когда("КлючОбъекта")
			.Вернуть(Неопределено);
	Мокито.Прогон();

	Результат = кфкИнтеграция.КлючОбъекта(Неопределено);

	ЮТест.ОжидаетЧто(Результат).Равно(Неопределено);

КонецПроцедуры

#КонецОбласти

#Область КлючЗаписиИсходящихСообщений

// Проверяет: ВозвращаетКлючиЗависимости.
Процедура КлючЗаписиИсходящихСообщений_ВозвращаетКлючиЗависимости() Экспорт

	Данные = Справочники.кфкПродюсеры.ПустаяСсылка();
	Ожидается = Новый Массив; // Массив Из Строка
	Ожидается.Добавить("ключ-записи-1");
	Ожидается.Добавить("ключ-записи-2");
	Аргументы = ЮТМетоды.МассивПараметров(Данные);
	Мокито.Обучение(кфкОбработкаСобытийСлужебный)
		.Когда("КлючЗаписиИсходящихСообщений", Аргументы)
			.Вернуть(Ожидается);
	Мокито.Прогон();

	Результат = кфкИнтеграция.КлючЗаписиИсходящихСообщений(Данные);

	ЮТест.ОжидаетЧто(Результат).Равно(Ожидается);
	Мокито.Проверить(кфкОбработкаСобытийСлужебный)
		.КоличествоВызовов("КлючЗаписиИсходящихСообщений", Аргументы).Равно(1);

КонецПроцедуры

// Проверяет: СохраняетНеопределенныйРезультат.
Процедура КлючЗаписиИсходящихСообщений_СохраняетНеопределенныйРезультат() Экспорт

	Мокито.Обучение(кфкОбработкаСобытийСлужебный)
		.Когда("КлючЗаписиИсходящихСообщений")
			.Вернуть(Неопределено);
	Мокито.Прогон();

	Результат = кфкИнтеграция.КлючЗаписиИсходящихСообщений(Неопределено);

	ЮТест.ОжидаетЧто(Результат).Равно(Неопределено);

КонецПроцедуры

#КонецОбласти

// Проверяет: ПередаетАргументыИРезультат.
// Параметры:
//  ПоУмолчанию - Булево - не передавать необязательные параметры.
Процедура Отправить_ПередаетАргументыИРезультат(Знач ПоУмолчанию) Экспорт

	Продюсер = Справочники.кфкПродюсеры.ПустаяСсылка();
	Топик = "unit-integration-topic";
	Сообщение = кфкИнтеграция.ПараметрыСообщения("тело", "ключ");
	Сессии = Новый Соответствие; // Соответствие Из КлючИЗначение
	Партиция = 3;
	Ожидается = кфкИнтеграция.РезультатИнтеграции();
	Ожидается.ТекстОшибки = "ответ зависимости";
	Мокито.Обучение(кфкИнтеграцияСлужебный)
		.Когда("Отправить")
			.Вернуть(Ожидается);
	Мокито.Прогон();

	Результат = кфкИнтеграция.РезультатИнтеграции();
	Аргументы = Новый Массив; // Массив Из Произвольный
	Если ПоУмолчанию Тогда

		Результат = кфкИнтеграция.Отправить(Продюсер, Топик, Сообщение);
		Аргументы = ЮТМетоды.МассивПараметров(Продюсер, Топик, Сообщение, -1, Неопределено);

	Иначе

		Результат = кфкИнтеграция.Отправить(Продюсер, Топик, Сообщение, Партиция, Сессии);
		Аргументы = ЮТМетоды.МассивПараметров(Продюсер, Топик, Сообщение, Партиция, Сессии);

	КонецЕсли;

	ЮТест.ОжидаетЧто(Результат).Равно(Ожидается);
	Мокито.Проверить(кфкИнтеграцияСлужебный)
		.КоличествоВызовов("Отправить", Аргументы).Равно(1);

КонецПроцедуры

// Проверяет: ПередаетАргументыИРезультат.
// Параметры:
//  АвтоФиксация - Булево - передаваемый режим фиксации смещения.
//  ПоУмолчанию - Булево - не передавать сессии.
Процедура Прочитать_ПередаетАргументыИРезультат(Знач АвтоФиксация, Знач ПоУмолчанию) Экспорт

	Консьюмер = Справочники.кфкКонсьюмеры.ПустаяСсылка();
	Сессии = Новый Соответствие; // Соответствие Из КлючИЗначение
	Ожидается = кфкИнтеграция.РезультатИнтеграции();
	Ожидается.Успешно = Истина;
	Мокито.Обучение(кфкИнтеграцияСлужебный)
		.Когда("Прочитать")
			.Вернуть(Ожидается);
	Мокито.Прогон();

	Результат = кфкИнтеграция.РезультатИнтеграции();
	Аргументы = Новый Массив; // Массив Из Произвольный
	Если ПоУмолчанию Тогда

		Результат = кфкИнтеграция.Прочитать(Консьюмер, АвтоФиксация);
		Аргументы = ЮТМетоды.МассивПараметров(Консьюмер, АвтоФиксация, Неопределено);

	Иначе

		Результат = кфкИнтеграция.Прочитать(Консьюмер, АвтоФиксация, Сессии);
		Аргументы = ЮТМетоды.МассивПараметров(Консьюмер, АвтоФиксация, Сессии);

	КонецЕсли;

	ЮТест.ОжидаетЧто(Результат).Равно(Ожидается);
	Мокито.Проверить(кфкИнтеграцияСлужебный)
		.КоличествоВызовов("Прочитать", Аргументы).Равно(1);

КонецПроцедуры

// Проверяет: ПередаетКоллекциюСессий.
Процедура ЗакрытьСессииПродюсера_ПередаетКоллекциюСессий() Экспорт

	Сессии = Новый Соответствие; // Соответствие Из КлючИЗначение
	Сессии.Вставить("идентификатор-сессии", Неопределено);
	Аргументы = ЮТМетоды.МассивПараметров(Сессии);
	Мокито.Обучение(кфкИнтеграцияСлужебный)
		.Когда("ЗакрытьСессииПродюсера")
			.Вернуть(Неопределено);
	Мокито.Прогон();

	кфкИнтеграция.ЗакрытьСессииПродюсера(Сессии);

	Мокито.Проверить(кфкИнтеграцияСлужебный)
		.КоличествоВызовов("ЗакрытьСессииПродюсера", Аргументы).Равно(1);

КонецПроцедуры

// Проверяет: ПередаетКоллекциюСессий.
Процедура ЗакрытьСессииКонсьюмера_ПередаетКоллекциюСессий() Экспорт

	Сессии = Новый Соответствие; // Соответствие Из КлючИЗначение
	Сессии.Вставить("идентификатор-сессии", Неопределено);
	Аргументы = ЮТМетоды.МассивПараметров(Сессии);
	Мокито.Обучение(кфкИнтеграцияСлужебный)
		.Когда("ЗакрытьСессииКонсьюмера")
			.Вернуть(Неопределено);
	Мокито.Прогон();

	кфкИнтеграция.ЗакрытьСессииКонсьюмера(Сессии);

	Мокито.Проверить(кфкИнтеграцияСлужебный)
		.КоличествоВызовов("ЗакрытьСессииКонсьюмера", Аргументы).Равно(1);

КонецПроцедуры

#Область ПараметрыСообщения

// Проверяет: СоздаетЗначенияПоУмолчанию.
Процедура ПараметрыСообщения_СоздаетЗначенияПоУмолчанию() Экспорт

	Результат = кфкИнтеграция.ПараметрыСообщения();

	ЮТест.ОжидаетЧто(Результат.Количество()).Равно(4);
	ЮТест.ОжидаетЧто(Результат.Данные).Равно("");
	ЮТест.ОжидаетЧто(Результат.Ключ).Равно("");
	ЮТест.ОжидаетЧто(ТипЗнч(Результат.Заголовки)).Равно(Тип("Соответствие"));
	ЮТест.ОжидаетЧто(Результат.Заголовки.Количество()).Равно(0);
	КлючКонструктора = кфкОбработкаСобытийСлужебный.КлючКонструктораСообщения();
	ЮТест.ОжидаетЧто(Результат[КлючКонструктора]).Равно(Истина);

КонецПроцедуры

// Проверяет: СохраняетДанныеИСоздаетНезависимыеЗаголовки.
Процедура ПараметрыСообщения_СохраняетДанныеИСоздаетНезависимыеЗаголовки() Экспорт

	Данные = Новый Структура("Событие", "создание");
	Ключ = "ключ-сообщения";

	Первое = кфкИнтеграция.ПараметрыСообщения(Данные, Ключ);
	Второе = кфкИнтеграция.ПараметрыСообщения(Данные, Ключ);
	Первое.Заголовки.Вставить("content-type", "application/json");

	ЮТест.ОжидаетЧто(Первое.Данные).Равно(Данные);
	ЮТест.ОжидаетЧто(Первое.Ключ).Равно(Ключ);
	ЮТест.ОжидаетЧто(Второе.Заголовки.Количество()).Равно(0);

КонецПроцедуры

#КонецОбласти

// Проверяет: СоздаетНезависимыеРезультаты.
Процедура РезультатИнтеграции_СоздаетНезависимыеРезультаты() Экспорт

	Первое = кфкИнтеграция.РезультатИнтеграции();
	Второе = кфкИнтеграция.РезультатИнтеграции();
	Первое.Успешно = Истина;
	Первое.ТекстОшибки = "измененный экземпляр";

	ЮТест.ОжидаетЧто(Второе.Количество()).Равно(2);
	ЮТест.ОжидаетЧто(Второе.Успешно).Равно(Ложь);
	ЮТест.ОжидаетЧто(Второе.ТекстОшибки).Равно("");

КонецПроцедуры

#Область ПриОпределенииКомандПодключенныхКОбъекту

// Проверяет: СкрываетКомандуНедоступнойПодсистемы.
Процедура ПриОпределенииКомандПодключенныхКОбъекту_СкрываетКомандуНедоступнойПодсистемы() Экспорт

	Настройки = Новый Структура("ВидВРег", "СПРАВОЧНИК");
	Источники = НовыеИсточники();
	Команды = НовыеКоманды();
	Мокито.Обучение(кфкОбщегоНазначенияСлужебный)
		.Когда("ПодсистемаДоступна")
			.Вернуть(Ложь);
	Мокито.Прогон();

	кфкИнтеграция.ПриОпределенииКомандПодключенныхКОбъекту(
		Настройки,
		Источники,
		Неопределено,
		Команды);

	ЮТест.ОжидаетЧто(Команды.Количество()).Равно(0);

КонецПроцедуры

// Проверяет: СкрываетКомандуНеучаствующегоРегистра.
// Параметры:
//  ДобавитьИсточник - Булево - неизвестный источник либо пустой список.
Процедура ПриОпределенииКомандПодключенныхКОбъекту_СкрываетКомандуНеучаствующегоРегистра(Знач ДобавитьИсточник) Экспорт

	Настройки = Новый Структура("ВидВРег", "РЕГИСТРСВЕДЕНИЙ");
	Источники = НовыеИсточники();
	Если ДобавитьИсточник Тогда
		Источники.Строки.Добавить().ПолноеИмя = "РегистрСведений.ДругойРегистр";
	КонецЕсли;
	Команды = НовыеКоманды();
	НастроитьКоманды();

	кфкИнтеграция.ПриОпределенииКомандПодключенныхКОбъекту(
		Настройки,
		Источники,
		Неопределено,
		Команды);

	ЮТест.ОжидаетЧто(Команды.Количество()).Равно(0);

КонецПроцедуры

// Проверяет: ДобавляетКомандуДляРегистра.
Процедура ПриОпределенииКомандПодключенныхКОбъекту_ДобавляетКомандуДляРегистра() Экспорт

	Настройки = Новый Структура("ВидВРег", "РЕГИСТРСВЕДЕНИЙ");
	Источники = НовыеИсточники();
	Источники.Строки.Добавить().ПолноеИмя = "РегистрСведений.ДругойРегистр";
	Источники.Строки.Добавить().ПолноеИмя = "РЕГИСТРСВЕДЕНИЙ.кфкВходящиеСообщения";
	Команды = НовыеКоманды();
	НастроитьКоманды();

	кфкИнтеграция.ПриОпределенииКомандПодключенныхКОбъекту(
		Настройки,
		Источники,
		Неопределено,
		Команды);

	ПроверитьКомандуИстории(Команды, Новый ОписаниеТипов);

КонецПроцедуры

// Проверяет: ДобавляетКомандуДляСсылочногоОбъекта.
Процедура ПриОпределенииКомандПодключенныхКОбъекту_ДобавляетКомандуДляСсылочногоОбъекта() Экспорт

	Настройки = Новый Структура("ВидВРег", "СПРАВОЧНИК");
	Источники = НовыеИсточники();
	Команды = НовыеКоманды();
	НастроитьКоманды();

	кфкИнтеграция.ПриОпределенииКомандПодключенныхКОбъекту(
		Настройки,
		Источники,
		Неопределено,
		Команды);

	ПроверитьКомандуИстории(Команды, Новый ОписаниеТипов("СправочникСсылка.кфкПродюсеры"));

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РегистрацияСообщений

// Создает параметры без реальной записи очереди.
//
// Возвращаемое значение:
//  Структура:
// * Продюсеры - Неопределено - продюсеры выбираются зависимостью.
// * ОчередьИсходящих - Неопределено - запись очереди подменена на границе зависимости.
Функция НовыеПараметрыРегистрации()

	Результат = Новый Структура("Продюсеры,ОчередьИсходящих", Неопределено, Неопределено);
	Возврат Результат;

КонецФункции

// Параметры:
//  Параметры - см. НовыеПараметрыРегистрации
Процедура НастроитьРегистрацию(Знач Параметры)

	РазмерПорции = 2;
	Мокито.Обучение(кфкОбработкаСобытийСлужебный)
		.Когда("ПараметрыРегистрации")
			.Вернуть(Параметры)
		.Когда("МаксРазмерПорцииРегистрации")
			.Вернуть(РазмерПорции)
		.Когда("ПоместитьВОчередьИсходящих")
			.Вернуть(Неопределено)
		.Когда("ЗавершитьРегистрацию")
			.Вернуть(Неопределено);
	Мокито.Прогон();

КонецПроцедуры

#КонецОбласти

#Область КомандыИстории

// Создает список источников подключаемой команды.
//
// Возвращаемое значение:
//  Структура:
// * Строки - ТаблицаЗначений:
// ** ПолноеИмя - Строка - полное имя источника формы.
Функция НовыеИсточники()

	Строки = Новый ТаблицаЗначений;
	Строки.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	Результат = Новый Структура("Строки", Строки);
	Возврат Результат;

КонецФункции

// Создает таблицу результата регистрации команд.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
// * Вид - Строка
// * Идентификатор - Строка
// * Представление - Строка
// * Важность - Строка
// * Картинка - Картинка
// * ТолькоВоВсехДействиях - Булево
// * ТипПараметра - ОписаниеТипов, Неопределено - ограничение типа параметра команды.
// * ФункциональныеОпции - Строка
// * МножественныйВыбор - Булево
// * РежимЗаписи - Строка
// * Обработчик - Строка
Функция НовыеКоманды()

	Результат = Новый ТаблицаЗначений;
	ТипСтроки = Новый ОписаниеТипов("Строка");
	ТипБулева = Новый ОписаниеТипов("Булево");
	Результат.Колонки.Добавить("Вид", ТипСтроки);
	Результат.Колонки.Добавить("Идентификатор", ТипСтроки);
	Результат.Колонки.Добавить("Представление", ТипСтроки);
	Результат.Колонки.Добавить("Важность", ТипСтроки);
	Результат.Колонки.Добавить("Картинка", Новый ОписаниеТипов("Картинка"));
	Результат.Колонки.Добавить("ТолькоВоВсехДействиях", ТипБулева);
	Результат.Колонки.Добавить("ТипПараметра", Новый ОписаниеТипов("ОписаниеТипов,Неопределено"));
	Результат.Колонки.Добавить("ФункциональныеОпции", ТипСтроки);
	Результат.Колонки.Добавить("МножественныйВыбор", ТипБулева);
	Результат.Колонки.Добавить("РежимЗаписи", ТипСтроки);
	Результат.Колонки.Добавить("Обработчик", ТипСтроки);
	Возврат Результат;

КонецФункции

Процедура НастроитьКоманды()

	ОбновитьПовторноИспользуемыеЗначения();
	Объекты = Новый Соответствие; // Соответствие Из КлючИЗначение
	Объекты.Вставить("регистрсведений.кфквходящиесообщения", Истина);
	Мокито.Обучение(кфкОбщегоНазначенияСлужебный)
		.Когда("ПодсистемаДоступна")
			.Вернуть(Истина);
	Мокито.Обучение(кфкИнтеграцияСлужебныйПовтИсп)
		.Когда("ОбъектыИнтеграции")
			.Вернуть(Объекты)
		.Когда("ТипыОбъектовИнтеграции")
			.Вернуть(Новый ОписаниеТипов("СправочникСсылка.кфкПродюсеры"));
	Мокито.Прогон();

КонецПроцедуры

// Параметры:
//  Команды - см. НовыеКоманды
//  ТипПараметра - Неопределено, ОписаниеТипов - ожидаемое ограничение типа.
Процедура ПроверитьКомандуИстории(Знач Команды, Знач ТипПараметра)

	ЮТест.ОжидаетЧто(Команды.Количество()).Равно(1);
	Команда = Команды[0];
	ЮТест.ОжидаетЧто(Команда.Вид).Равно("КоманднаяПанель");
	ЮТест.ОжидаетЧто(Команда.Идентификатор).Равно("кфкИсторияВыгрузки");
	ЮТест.ОжидаетЧто(Команда.Представление).Равно("История выгрузки (Kafka)");
	ЮТест.ОжидаетЧто(Команда.Важность).Равно("СмТакже");
	ЮТест.ОжидаетЧто(Команда.Картинка).Равно(БиблиотекаКартинок.История);
	ЮТест.ОжидаетЧто(Команда.ТолькоВоВсехДействиях).Равно(Истина);
	ЮТест.ОжидаетЧто(Команда.ТипПараметра).Равно(ТипПараметра);
	ЮТест.ОжидаетЧто(Команда.ФункциональныеОпции).Равно("кфкИспользоватьИнтеграцию");
	ЮТест.ОжидаетЧто(Команда.МножественныйВыбор).Равно(Ложь);
	ЮТест.ОжидаетЧто(Команда.РежимЗаписи).Равно("ЗаписыватьТолькоНовые");
	ЮТест.ОжидаетЧто(Команда.Обработчик).Равно("кфкИнтеграцияКлиент.ВыполнитьПодключаемуюКоманду");

КонецПроцедуры

#КонецОбласти

#КонецОбласти
