Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкПараметрыОчисткиХранилища. Модуль менеджера. ПолучитьПараметры()")
			.ДобавитьСерверныйТест("ПолучитьПараметры_ВозвращаетЗначенияПоУмолчанию",
				"ПолучитьПараметры(). Возвращает значения по умолчанию")
				.Перед("ОчиститьДанные")
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкПараметрыОчисткиХранилища. Модуль менеджера. ОбновитьПараметры()")
			.ДобавитьСерверныйТест("ОбновитьПараметры_СохраняетВсеЗначения",
				"ОбновитьПараметры(). Сохраняет все значения")
				.Перед("ОчиститьДанные");
	
КонецПроцедуры

Процедура ОчиститьДанные() Экспорт
	РегистрыСведений.кфкПараметрыОчисткиХранилища.СоздатьНаборЗаписей().Записать();
КонецПроцедуры



Процедура ПолучитьПараметры_ВозвращаетЗначенияПоУмолчанию() Экспорт
	
	Параметры = РегистрыСведений.кфкПараметрыОчисткиХранилища.ПолучитьПараметры();
	
	ЮТест.ОжидаетЧто(Параметры, "Параметры очистки хранилища")
		.Равно(ПараметрыПоУмолчанию());
	
КонецПроцедуры

Процедура ОбновитьПараметры_СохраняетВсеЗначения() Экспорт
	
	ОжидаемыеПараметры = Новый Структура;
	ОжидаемыеПараметры.Вставить("СрокХраненияНезавершенных", 11);
	ОжидаемыеПараметры.Вставить("СрокХраненияОшибкиОбработкиИсходящих", 12);
	ОжидаемыеПараметры.Вставить("СрокХраненияОтмененныхИсходящих", 13);
	ОжидаемыеПараметры.Вставить("СрокХраненияОшибкиОтправки", 14);
	ОжидаемыеПараметры.Вставить("СрокХраненияОтправленных", 15);
	ОжидаемыеПараметры.Вставить("СрокХраненияОшибкиОбработкиВходящих", 16);
	ОжидаемыеПараметры.Вставить("СрокХраненияОтмененныхВходящих", 17);
	ОжидаемыеПараметры.Вставить("СрокХраненияОбработанных", 18);
	ОжидаемыеПараметры.Вставить("СрокХраненияХэшСуммыСообщений", 19);
	
	РегистрыСведений.кфкПараметрыОчисткиХранилища.ОбновитьПараметры(ОжидаемыеПараметры);
	ФактическиеПараметры = РегистрыСведений.кфкПараметрыОчисткиХранилища.ПолучитьПараметры();
	
	ЮТест.ОжидаетЧто(ФактическиеПараметры, "Сохраненные параметры очистки хранилища")
		.Равно(ОжидаемыеПараметры);
	
КонецПроцедуры

Функция ПараметрыПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("СрокХраненияНезавершенных", 7);
	Результат.Вставить("СрокХраненияОшибкиОбработкиИсходящих", 3);
	Результат.Вставить("СрокХраненияОтмененныхИсходящих", 1);
	Результат.Вставить("СрокХраненияОшибкиОтправки", 3);
	Результат.Вставить("СрокХраненияОтправленных", 1);
	Результат.Вставить("СрокХраненияОшибкиОбработкиВходящих", 3);
	Результат.Вставить("СрокХраненияОтмененныхВходящих", 1);
	Результат.Вставить("СрокХраненияОбработанных", 1);
	Результат.Вставить("СрокХраненияХэшСуммыСообщений", 3);
	
	Возврат Результат;
	
КонецФункции
