//@strict-types

#Область СлужебныеПроцедурыИФункции

// См. кфкОбщегоНазначенияСлужебный.ПодсистемаДоступна
&Around("ПодсистемаДоступна")
Функция ют_ПодсистемаДоступна()

	Аргументы = Новый Массив; // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкОбщегоНазначенияСлужебный,
		"ПодсистемаДоступна",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов();
	Возврат Результат;

КонецФункции

#КонецОбласти
