#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.ДобавитьТестовыйНабор("Справочник кфкБрокеры. Модуль менеджера. ДоступныеБрокеры()")
			.ДобавитьСерверныйТест("ДоступныеБрокеры_ВозвращаетОписаниеПодготовленногоБрокера",
				"ДоступныеБрокеры(). Возвращает описание подготовленного брокера")
		.ДобавитьТестовыйНабор("Справочник кфкБрокеры. Модуль менеджера. АдресБрокера()")
			.ДобавитьСерверныйТест("АдресБрокера_ВозвращаетТолькоИспользуемыеУзлы",
				"АдресБрокера(). Возвращает адреса только используемых узлов")
			.ДобавитьСерверныйТест("АдресБрокера_ВозвращаетПустуюСтрокуДляПустойСсылки",
				"АдресБрокера(). Возвращает пустую строку для пустой ссылки");
	
КонецПроцедуры

Процедура ДоступныеБрокеры_ВозвращаетОписаниеПодготовленногоБрокера() Экспорт
	
	Брокер = БрокерПоУмолчанию();
	
	ДоступныеБрокеры = Справочники.кфкБрокеры.ДоступныеБрокеры();
	Описание = ДоступныеБрокеры.Получить(Брокер);
	
	ОжидаемыеСвойства = Новый Структура(
		"Ссылка,Наименование,АдресБрокера",
		Брокер,
		"Брокер по умолчанию",
		"localhost:29091,localhost:29092");
	
	ЮТест.ОжидаетЧто(ДоступныеБрокеры, "Доступные брокеры")
		.ИмеетДлину(1);
	ЮТест.ОжидаетЧто(Описание, "Описание брокера")
		.ИмеетСвойстваРавные(ОжидаемыеСвойства);
	ЮТест.ОжидаетЧто(Описание.ПараметрыПодключения, "Параметры подключения брокера")
		.ИмеетДлину(0);
	
КонецПроцедуры

Процедура АдресБрокера_ВозвращаетТолькоИспользуемыеУзлы() Экспорт
	
	Адрес = Справочники.кфкБрокеры.АдресБрокера(БрокерПоУмолчанию());
	
	ЮТест.ОжидаетЧто(Адрес)
		.Равно("localhost:29091,localhost:29092");
	
КонецПроцедуры

Процедура АдресБрокера_ВозвращаетПустуюСтрокуДляПустойСсылки() Экспорт
	
	Адрес = Справочники.кфкБрокеры.АдресБрокера(
		Справочники.кфкБрокеры.ПустаяСсылка());
	
	ЮТест.ОжидаетЧто(Адрес)
		.Равно("");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция БрокерПоУмолчанию()
	Возврат кфк_т_ТестовыеДанные.СсылкаБрокераПоУмолчанию();
КонецФункции

#КонецОбласти
