#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Обработка кфкПанельАдминистрирования. Модуль менеджера. ФоновыеЗадания()")
			.Тег("Модульные")
			.Тег("кфкПанельАдминистрирования")
			.Тег("ФоновыеЗадания")
			.ДобавитьСерверныйТест("ФоновыеЗадания_ВозвращаетМассив",
				"ФоновыеЗадания(). Возвращает массив описаний фоновых заданий")
				.Тег("ВозвращаетМассив");
	
КонецПроцедуры

Процедура ФоновыеЗадания_ВозвращаетМассив() Экспорт
	
	ОписанияЗаданий = Обработки.кфкПанельАдминистрирования.ФоновыеЗадания();
	
	ЮТест.ОжидаетЧто(ОписанияЗаданий, "Описания фоновых заданий")
		.ИмеетТип("Массив");
	
КонецПроцедуры

#КонецОбласти
