//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// См. Справочники.кфкПродюсеры.ОбъектыИнтеграции
&Around("ОбъектыИнтеграции")
Функция ют_ОбъектыИнтеграции()

	Аргументы = Новый Массив; // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		Справочники.кфкПродюсеры,
		"ОбъектыИнтеграции",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов();
	Возврат Результат;

КонецФункции

// См. Справочники.кфкПродюсеры.ИменаОбъектовИнтеграции
&Around("ИменаОбъектовИнтеграции")
Функция ют_ИменаОбъектовИнтеграции()

	Аргументы = Новый Массив; // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		Справочники.кфкПродюсеры,
		"ИменаОбъектовИнтеграции",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов();
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
