#Область СлужебныеПроцедурыИФункции

// См. кфкИнтеграцияСлужебныйПовтИсп.ОбъектыИнтеграции
&Around("ОбъектыИнтеграции")
Функция ют_ОбъектыИнтеграции()

	Аргументы = Новый Массив; // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкИнтеграцияСлужебныйПовтИсп,
		"ОбъектыИнтеграции",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов();
	Возврат Результат;

КонецФункции

// См. кфкИнтеграцияСлужебныйПовтИсп.ТипыОбъектовИнтеграции
&Around("ТипыОбъектовИнтеграции")
Функция ют_ТипыОбъектовИнтеграции()

	Аргументы = Новый Массив; // Массив Из Произвольный
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(
		кфкИнтеграцияСлужебныйПовтИсп,
		"ТипыОбъектовИнтеграции",
		Аргументы,
		ПрерватьВыполнение);

	Если ПрерватьВыполнение Тогда
		Возврат Результат;
	КонецЕсли;

	Результат = ПродолжитьВызов();
	Возврат Результат;

КонецФункции

#КонецОбласти
